Revit 2024 API
FamilyParameterSet.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	FamilyParameter item
)
Visual Basic
Public Overridable Function Erase ( _
	item As FamilyParameter _
) As Integer
Visual C++
public:
virtual int Erase(
	FamilyParameter^ item
)
Parameters
item
Type: Autodesk.Revit.DB.FamilyParameter
See Also
FamilyParameterSet Class
Autodesk.Revit.DB Namespace